; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :equality :typing)
    (:types
        location - object
        locatable - object
        driver - locatable
        truck - locatable
        obj - locatable
    )

    (:constants
        
    )

    (:predicates
        (at ?x1 - locatable ?x2 - location)
        (in ?x1 - obj ?x2 - truck)
        (driving ?x1 - driver ?x2 - truck)
        (link ?x1 - location ?x2 - location)
        (path ?x1 - location ?x2 - location)
        (empty ?x1 - truck)
    )

    (:functions
        
    )

    

    
    (:action LOAD-TRUCK
     :parameters (?obj - obj ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (at ?obj ?loc))
     :effect (and
        (in ?obj ?truck)
        (not (at ?obj ?loc)))
    )


    (:action UNLOAD-TRUCK
     :parameters (?obj - obj ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (in ?obj ?truck))
     :effect (and
        (at ?obj ?loc)
        (not (in ?obj ?truck)))
    )


    (:action BOARD-TRUCK
     :parameters (?driver - driver ?truck - truck ?loc - location)
     :precondition (empty ?truck)
     :effect (and
        (driving ?driver ?truck)
        (not (at ?driver ?loc))
        (not (empty ?truck)))
    )


    (:action DISEMBARK-TRUCK
     :parameters (?driver - driver ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
     :effect (and
        (at ?driver ?loc)
        (empty ?truck)
        (not (driving ?driver ?truck)))
    )


    (:action DRIVE-TRUCK
     :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
     :precondition (and (at ?truck ?loc-from) (driving ?driver ?truck) (link ?loc-from ?loc-to))
     :effect (and
        (at ?truck ?loc-to)
        (not (at ?truck ?loc-from)))
    )


    (:action WALK
     :parameters (?driver - driver ?loc-from - location ?loc-to - location)
     :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
     :effect (and
        (at ?driver ?loc-to)
        (not (at ?driver ?loc-from)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        driver1 driver2 - driver
        p0-1 p0-2 p1-0 p2-1 s0 s1 s2 - location
        package1 package2 package3 - obj
        truck1 truck2 - truck
    )

    (:init
        (at truck2 s1)
        (at package2 s1)
        (at driver2 s0)
        (at package1 s2)
        (at package3 s1)
        (at truck1 s0)
        (at driver1 s0)
        (empty truck1)
        (empty truck2)
        (path s1 p2-1)
        (path s0 p0-2)
        (path p0-1 s0)
        (path p2-1 s2)
        (path s1 p0-1)
        (path s2 p0-2)
        (path p2-1 s1)
        (path p0-1 s1)
        (path p0-2 s0)
        (path s0 p0-1)
        (path s2 p2-1)
        (path p0-2 s2)
        (link s2 s1)
        (link s1 s2)
        (link s2 s0)
        (link s0 s2)
        (link s0 s1)
        (link s1 s0)
    )

    (:goal
        (and (at package2 s2) (at package1 s0) (at truck1 s2) (at driver1 s1) (at driver2 s1) (at truck2 s0) (at package3 s0))
    )

    
    
    
)

; plan
1. (load-truck package3 truck2 s1)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 0 of 7
2. (board-truck driver1 truck2 p0-1)
   deleted: (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 7
3. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 1 of 7
4. (board-truck driver2 truck1 p0-1)
   deleted: (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 7
5. (board-truck driver2 truck2 p0-1)
   deleted: (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 7
6. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   goals met: 1 of 7
7. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 1 of 7
8. (unload-truck package2 truck2 s2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   goals met: 2 of 7
9. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 2 of 7
10. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 3 of 7
11. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 3 of 7
12. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 4 of 7
13. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 5 of 7
14. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 6 of 7
15. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 7 of 7
